[{"id":1742540400,"title":"does this still work","author":"androo","date":"March 21, 2025","content":"i'll be surprised if this webshite still works\n"},{"id":1678690800,"title":"fixing my site and stealing christian music","author":"androo","date":"March 13, 2023","content":"Fixed my site after I accidentally broke it last month when trying to make the repo private. I made the repo public again, but I think the thing that actually broke it was that in the \"Settings\" tab of my repo the GH Pages branch was set to deploy from branch `None` instead of `gh-pages`. Might play around with trying to make this repo private again just so my coworkers don't go snooping and finding these random notes to see how much I suck at coding.\n\nOn to the other part of this title -- this sermon from TCPC Open Worship had the most BEAUTIFUL sounding performance for O Come to the Alter. The sad part is I don't even know who the singer is. Since I couldn't find a better version of it on Spotify, thought the only appropriate thing to do here was:\n-  use `pytube` to download the [YT sermon video](https://www.youtube.com/watch?v=ZM7-EwfJbpg) as an MP4\n- convert to MP3 using FFMPEG: `ffmpeg -i sermon.mp4 -vn -acodec libmp3lame -qscale:a 0 sermon.mp3` \n   - description of the fields from ChatGPT:  The -ss option specifies the start time of the crop (in this case, 30 seconds), and the -to option specifies the end time of the crop (in this case, 60 seconds). The -c:a copy option tells FFmpeg to copy the audio codec instead of re-encoding it.\n- trim the video `ffmpeg -i sermon.mp3 -ss 1:17:34 -to 1:24:06 -c:a copy come_to_the_alter.mp3`\n    - description of fields from ChatGPT: The -vn option tells FFmpeg to disable video recording, and the -acodec libmp3lame option specifies the audio codec to be used for the MP3 file. The -qscale:a option specifies the audio quality, where 0 is the best and 9 is the worst, and in this example, 2 is used.\n\nIt's a real shame TCPC OW stopped doing sermon livestreams (honest note here)... I really did like their sermons but I understand their mission to try and grow the church in person. Wish them the best and hope someday to maybe even visit them.\n\nOne last thing: when updating the posts for this website I have to remember to run `node public/main.js` to generate the JSON blobs for each page. What stumped me for like 30 FREAKING MINUTES THO was that this kept failing because it kept trying to parse the hidden file `.DS_Store` that's auto-generated on Macs..."},{"id":1675238400,"title":"Overengineering a Discord Reminder","author":"androo","date":"February 1, 2023","content":"\n## Context\nWe created a Discord server for the YF kids to use as a discussion and reminder group to read along for the book\n\"A Purpose Driven Life\" by Pastor Rick Warren. Each chapter had a title, verse to remember, point to ponder, and \nquestion. I thought it would b neat to have these all included in the daily notification. Instead of spending an\nhour to put these all in a spreadsheet to read from and automatically notify using the Integromet/Make bot\nfrom Discord, I thought it would be fun to waste ~3 hours to automate the spreadsheet population.\n\nThe data was posted on the official website for the book (albiet each chapter had its own page route) [3] and scraped\n using BeautifulSoup [4].\n\n## Workflow automation\nSetting up the workflow for going from Google Sheets -> Http API server -> Discord bot was fairly straightforard.\nUsed the references [0][1] and took a couple minutes to setup. It was somewhat straightforward. The tutorials were\nokay. It was weird how clicking on components (specifically the Spreadsheet API component) sometimes let me \nconfigure it but not configure where on the spreadsheet to start. I would have to right-click on it but it was't \nvery consistent.\n\n## Scraping\nUsed the official Purpose Driven Life website to scrape the \"point to ponder\", \"verse to remember\", and \"question\".\nWhat was awkward was the chapter titles weren't from this site directly so I couldn't scrape from there. Instead\nI just copy/pasted the table of contents in the pages from the PDF we were given and did some jank multi-line editing\nmagics with vim.\n\nInteresting, I was getting a bunch of Forbidden 403 responses when trying to scrape. Apparently the workaround\nis fairly simple: disguise the request as if it was being sent from a standard Mozilla browser. https://medium.com/@raiyanquaium/how-to-web-scrape-using-beautiful-soup-in-python-without-running-into-http-error-403-554875e5abed\n\nThere is also a few parsers out there for parsing the HTML, this answer gives a good overview of the differences https://stackoverflow.com/a/45494776\n\n## Sheeting\nUsed the Google Sheets API to dump values into a spreadsheet. The only gotcha was setting up auth. Just used the setup code from the initial \"get\" example that reads a credentials.json which generated a token.json. Auth is always\nboring/annoying imo.\n\nOverall this was a pretty fun project. I thought about creating a full Discord bot for this, but I'm lazy. And I \nwanted to use Inteogrmet/Make bot instead of hosting it myself because I actually created this while on a business\ntrip so I didn't have any computers/RPIs on hand.\n\n\n[0] https://www.make.com/en/help/app/discord#connect-to-discord-using-oauth2-and-your-own-credentials\n\n[1] https://www.integromat.com/en/help/how-to-send-a-message-to-a-discord-channel-via-http-when-a-google-sheet-is-updated\n\n[3] https://www.purposedriven.com/day1\n\n[4] https://www.crummy.com/software/BeautifulSoup/bs4/doc/\n"},{"id":1674201600,"title":"cool webgl demo from hackernews","author":"androo","date":"January 20, 2023","content":"original link: https://summer-afternoon.vlucendo.com/\n\npretty sick imo\nhttps://vlucendo.com/\n\n"},{"id":1674201600,"title":"performance reviews","author":"androo","date":"January 20, 2023","content":"## Resource dump\nHaven't been able to really work on this at all since holiday :(\n\nPerformance reviews at work have been going on so I haven't really been free at all.\n\nOn top of that we also still have to wrap up Q1 planning which is taking forever... I really need to research more on observability/monitoring for upcoming projects. I have an idea for what we're doing but I want to see what others are doing in industry to see areas for how we can improve before we start working and laying down the foundation for some of the stuff we have for Q1.\n\nIn the meantime I'm going to dump some links I was looking at along with a ChatGPT response for who are some notable people in SRE industry. Will look into some books/tech talks that they may have had.\n\n```\nBen Treynor: Ben is the founder of Google's SRE team, and he is widely considered to be the inventor of the SRE discipline. He is known for his work on SLOs (Service Level Objectives) and SLI (Service Level Indicator) which are widely adopted in the industry.\n\nCharity Majors: Charity is the co-founder of Honeycomb.io, a company that specializes in observability tools. She is a well-known speaker and author on observability and SRE, and she is known for her work on the \"Observability\" book.\n\nCindy Sridharan: Cindy is a principal engineer at GitHub, where she leads the SRE team. She is a well-known speaker and author on SRE, and she is known for her work on \"Distributed Systems Observability\"\n\nTom Limoncelli: Tom is an SRE and DevOps consultant, author and speaker. He wrote several books on SRE and IT Operations, including \"The Practice of System and Network Administration\" and \"Time Management for System Administrators\".\n\nLiz Fong-Jones: Liz is an SRE and developer advocate at Honeycomb.io and previously at Google. She is well known for her advocacy of SRE, and has written and spoken extensively about SRE and observability, particularly on the topic of incident management.\n```\n\nhttps://medium.com/airbnb-engineering/airbnb-engineering-infrastructure/home\n\nSome links from my mentor:\n* https://www.youtube.com/watch?v=lJ8ydIuPFeU\n\n* https://www.youtube.com/watch?v=bnnacleqg6k\n\n* https://www.youtube.com/watch?v=5ZjhNTM8XU8 \n\n* https://www.youtube.com/watch?v=cNICGEwmXLU\n\n* https://www.youtube.com/watch?v=SxdOUGdseq4\n\n* https://www.youtube.com/watch?v=m64SWl9bfvk\n\n* https://www.youtube.com/watch?v=lkgszkPnV8g\n\n* https://www.youtube.com/watch?v=kPR8h4-qZdk\n\n* https://www.youtube.com/watch?v=WLDT1lDOsb4\n\n> And here's a few talks from my favorite conferences that I haven't watched but look relevant/interesting:\n\n* https://www.youtube.com/watch?v=oIikwmeGVYY\n\n> Also a good blog article about latency measurement: https://danluu.com/latency-pitfalls/\n\n \n\n> Dan Luu has a ton of really good articles, I'd highly recommend skimming his list\n\n \n\nhttps://danluu.com/perf-tracing/\n\nhttps://danluu.com/concurrency-bugs/\n\nhttps://danluu.com/p95-skill/\n\nhttps://danluu.com/metrics-analytics/\n\nhttps://danluu.com/tracing-analytics/\n\nhttps://danluu.com/cache-incidents/\n"},{"id":1672646400,"title":"Making my first garbage website\r","author":"androo\r","date":"January 2, 2023\r","content":"## React Website Notes\r\n### Preface\r\nJotting down some random notes here. This isn’t meant to be an educational guide but just notes for me to refer back to for some stuff I thought were noteworthy while building this site. Apologies for it being very syntatically messy; I wanted to document in MD (and the remainder of posts in this site thankfully will be) but I used Google Docs to start off and its MD support is pretty garbage. Still lots to fix up for the site but posting this for now.\r\n\r\nI was a bit ambivalent about blogging in the beginning because of posts like this [one I read just today](https://news.ycombinator.com/item?id=34223288) but then I realized no one cares and I hope that I and this blog will remain mostly unseen by the public. I just wanna learn how to build cool websites.\r\n\r\n### Starting Tutorial\r\nRef: https://www.youtube.com/playlist?list=PLASldBPN_pkBfRXOkBOaeCJYzCnISw5-Z \r\n\r\nFirst of all there’s a difference between npm and npx. The former is the standard node package manager while the other is something installed from npm that is somewhat of a short-hand tool to also execute npm binaries [0].\r\n\r\nWe’re going to create a `content/` directory in the `$root/src/` directory. This will hold all the MD files that will be the posts for our blog.\r\n\r\nTypically we have some kind of database to store the files and they’re read in from the ORM or DB, but it looks like in the video he’s coming up with his own format for storing/querying the Markdown.\r\n\r\nTo read the data from our `content/` directory, we created a `getposts.js` file in the `$root/public/directory`. Might want to clean this up later by using a DB and adding that component into our app or perhaps just making a `models.js` folder to better clearly define the abstractions.\r\n\r\nSo this is kind of wacky; we’re invoking a CLI command in the `$root/package.json` under the list of scripts, ours labeled as `“server”`.\r\n\r\n```\r\n  \"scripts\": {\r\n    // …\r\n    \"server\": \"node public/getposts.js\"\r\n  },\r\n```\r\n\r\nInstead of running with npm start, we run the above with `npm run server`. Not really sure why this is.\r\n\r\n### Pondering routing\r\nTrying to understand routing; looks like we have react-router/react-router-dom? to do routing on the frontend, express.js to do routing from the backend, and axios to make HTTP requests from frontend to backend [1]. This is probably out of scope (the backend part) for now, but was curious about this. The definition of routing also seems to be adding mapping “routes” to resources such as pages (think more pages in a URL) for the frontend and elements (routes may lead to different processes/functions) in the backend I think. Will need to dig into this more later.\r\n\r\n\r\n### Siderant from DTao about webdev stuff\r\nRants and notes from DTao:\r\n- Look into this for perf! Millionjs [2]\r\n- https://swc.rs/\r\n- Use vercel with next.js, better than netlify - though it has good wrappers around lambda.\r\n- Vercel abstracts it all away (they sponsor million.js)\r\n- yarn is another pkg manager substitutional to npm (node package manager). npm is slower than yarn.\r\n- pnpm is similar to above but supposed to be better optimized. Used more in China apparently due to using symlinks.\r\n- Try and get as little JS to the client as possible.\r\n- Remix and next.js help speed up this stuff.\r\n- Look into edge runtimes, page streaming, progressive web apps, want to get your app feel like a single-page app.\r\n- Deno hard to ever get as good as node. Bun still too nascent.\r\n- JSX gets bundled into react\r\n- Bundler does some stuff with its interpreter\r\nAttributes from JSX are props, it interprets it and feeds it into react framework to render.\r\nThis is to stop react element nested calls. See here how JSX transpiler 1:1 to React code and how the JSX is much nicer to read than React. [6]\r\n- Better Asana called linear [7]\r\n\r\nThese notes are probably incomprehensible since I was just listening and writing things that stuck out to me.\r\n\r\n\r\n### Trying Gatsby\r\nTrying to install Gatsby.js, failing due to dependency errors\r\nI wanted to try and use Gatsby.js to build the blog site instead since it sounded like that was a popular framework (or tool?) to use, but it seems to be very hard to do.\r\n\r\nWhen I installed gatsby it complained that my node version was too old. I was running node version 17.9.1 while gatsby 5.0+ needed node to be on version 18.0.0+ [8]. \r\n\r\nI also had no idea, but apparently the even numbered node versions lose support (reach EOL) as soon as the next major version comes out while the even numbered ones keep long-term-support (LTS), meaning my version 17.9.1 is no longer supported [9]. \r\n\r\nWhen trying to upgrade node to either version 18.X or 19.X I kept on getting the error:\r\n`node: /lib/x86_64-linux-gnu/libc.so.6: version 'GLIBC_2.28' not found (required by node)`\r\n\r\nApparently GLIBC only has version 2.27 for Ubuntu 18.04, this is some other thread I see where others complain of an application with a GLIC == 2.28 dependency breaking on Ubuntu 18.04 LTS [10].\r\n\r\nThe options from here were to try and upgrade GLIBC to 2.28+ or upgrade Ubuntu 18.04 -> 20.04 or 22.04, noting that I’m not an actual Linux machine but am instead using WSL. Apparently the latter is quite a bit of work [11], but the former runs the risk of breaking your OS [12].\r\n\r\nFor now maybe I’ll just stick to building without Gatsby, this way at least I’ll learn a bit of react-router and then just upgrade my version of WSL Ubuntu later.\r\n\r\nTODO:\r\nUpgrade Ubuntu WSL\r\nGet off non-LTS node versions\r\nBack to tutorial, looking at routing\r\nInstalling the packages:\r\nreact-router-dom \r\nReact-markdown: markdown parser for react\r\n\r\nApparently these have a security vulnerability or something and I ran npm audit as it told me to, but then ran into some more GLIBC problems again so now I’m really hoping to upgrade WSL later.\r\n\r\n### Going back to tutorial, adding static Routing\r\nSo trying to add routing actually was harder than I thought. I’m not sure how in the world the guy in the video had it working – I did exactly what he did and it didn’t work. I’m wondering/hoping the reason was simply because we had different versions of react-dom-router or something since the video is 3 years old.\r\n\r\nInstead I asked ChatGPT what to do and it recommended I put the routing in a separate routes.js file, have that file present in the App component, and just have the App component rendered by the ReactDOM in the top-level index.js as it was before. Not sure if this is the right way to do things but it’s working for me for now. \r\n\r\nChatGPT response attached in the appendix below.\r\n\r\nOkay I’m just going to do routing from App() in App.js. I tried splitting up the routing but wasted an hour because for the life of me I couldn’t get it to work. The routing works from App.js but when I separate it into its own JS file and import it it doesn’t work and I couldn’t figure out why so screw it.\r\n\r\nI was able to add the headers and footers just fine as described in the video. What’s interesting is that he had them encapsulated in a layout component and had the App simply render the Layout. I wonder if this is best practice? Each page will likely be composed of several other components, so should we have a Layout top-level component for each page perhaps?\r\n\r\nAlso added some CSS flex stuff to the layout to push the footer to the bottom of the page and have proper spacing for the blogposts. Will be good to look back at these later for reference.\r\n\r\nAnother interesting note on CSS, so our file structure for pages currently looks like:\r\n\r\n```\r\n├── components/\r\n│   ├── components.css\r\n│   ├── footer.js\r\n│   ├── header.js\r\n│   └── layout.js\r\n```\r\n\r\nWe use `<Header />` and `<Footer />` components in `layout.js`. All of them have CSS styling in components.css, and we import the CSS in only `layout.js` (the most top-level module in this directory). Importing CSS in footer and header is redundant, and omitting the CSS import from `layout.js` and adding individually in `footer.js` or `header.js` doesn’t work.\r\n\r\nAlso some random trivia for myself: we do need to commit the `package*.json` files since they track dependencies [13]. TLDR, package.json has a 100ft view of the dependency tree and has minimum required versions for packages to install. `package-lock.json` is more like a 10ft view or is at least more granular or something. Doing an npm install in a directory looks for the `package*.json` files to find what packages to install.\r\n\r\nSo to review and summarize, this is our current dependency tree (for important files I’ve interacted with):\r\n\r\n```\r\n├── public/\r\n│   ├── main.js\r\n├── src/\r\n│   ├── components/\r\n│       ├── components.css\r\n│       ├── footer.js\r\n│       ├── header.js\r\n│       └── layout.js\r\n│   ├── pages/\r\n│       ├── pages.css\r\n│       └── home.js\r\n│   ├── posts/\r\n│       ├── firstpost.md\r\n│       └── secondpost.md\r\n│   ├── App.js\r\n├── App.js\r\n└── index.js\r\n```\r\n\r\n- Index.js is the top-most level where the ReactDOM renders the root component.\r\n- App.js is the root component and doesn’t render anything really (though it can and probably should). At the moment it does the routing to other pages.\r\n- The only route we have thus far is to the home page defined in src/pages/home.js.\r\nThe Home component simply uses the Layout component and the meat of its contents (still WIP) I’m guessing will be showing the posts. \r\n- The posts are retrieved via a special getPosts() method defined in public/main.js. \r\n- The posts read in by getPosts() write them in JSON format as posts.json in our src/ folder.\r\n- The actual posts themselves are stored in src/posts/ in Markdown.\r\n- The Layout component is defined in our src/components/ folder and is made up of two more components: header and footer which are also contained in this component folder.\r\n\r\nAlso some interesting disambiguation between Element and Component since in my head I was using them interchangeably [14].\r\n\r\nFont is still broken. We’re using a Google font called Railway which seems nice. Shouldn’t be too hard to fix, I think I just need to download it and add to project somehow. I was going to do it but when I looked at how to do this the stack overflow article wouldn’t load because it said stack exchange was doing maintenance. Think my network is just being dumb.\r\n\r\nAlso added a YouTube embed to a post which was kinda interesting. Didn’t realize I had to change the URL to have ‘embed’ in there instead of ‘watch’ [16].\r\n\r\nThere were also a lot of problems using the ReactMarkdown package he used. They revamped their API so the current version I was on had none of the props he used. The library API docs are here [17], and also had to download an extra plugin to render the HTML properly [18] [19].\r\n\r\n### Dynamic Routing\r\nThe tutorial was quite old and so the APIs for doing dynamic routing weren’t relevant anymore. Luckily was able to find a post of how to do dynamic routing and getting props in via React Hooks instead [20].\r\n\r\nAnother change in redirecting is that `Redirect` Seems to have been deprecated from react-router-dom. Instead we use `Navigate` as suggested by this article [21].\r\n\r\nAlright so I actually kinda went ahead and finished but went to sleep before documenting because it was like almost 6 AM. Gonna try and document current state of things and how I got there.\r\n\r\nSo looking at the file tree again:\r\n```\r\n├── public/\r\n│   ├── main.js\r\n│   └── CNAME\r\n├── src/\r\n│   ├── components/\r\n│       ├── components.css\r\n│       ├── footer.js\r\n│       ├── header.js\r\n│       ├── postlist.js\r\n│       ├── navbar.js\r\n│       └── layout.js\r\n│   ├── pages/\r\n│       ├── content/\r\n│           ├── about.md\r\n│       ├── pages.css\r\n│       ├── about.js\r\n│       ├── notfound.js\r\n│       ├── post.js\r\n│       └── home.js\r\n│   ├── posts/\r\n│       ├── firstpost.md\r\n│       └── secondpost.md\r\n├── pages.json\r\n├── posts.json\r\n├── App.js\r\n└── index.js\r\n```\r\n\r\nThe file list has grown quite a bit but will try and summarize what’s going on here.\r\n\r\n- `public/` has main.js which has the helper functions to read MD files and output them in json. \r\n  - All the MD posts from `src/posts/` are saved into posts.json and MD files in `src/pages/content/` are saved into pages.json.\r\n`CNAME` is a DNS record file for letting me redirect the domain from a github.io site to my own site.\r\n- `src/components/` has the React components and the styling CSS file.\r\n  - Each one is fairly straightforward and follows the same pattern of having React imported, creating a function to return some JSX, and exporting the function\r\n  - The components may be used by each other; `layouts.js` uses `header.js` and `footer.js` for example.\r\n  - The `navbar.js` component uses Links from react-router-dom to create a navbar and have links.\r\n  - `postlist.js` reads from posts.json and renders the posts in a list for us to show while also truncating some of it.\r\n- `src/pages` contains the pages (each page has its own JS file) and CSS, and the components are used here.\r\n- `App.js` handles all the routing.\r\n`Index.js` just renders the App component.\r\n\r\n### Deploying to Github Pages\r\nThe method of deploying was fairly straightforward: \r\n\r\nGot help forwarding the domain to a Google domains site here though [23]. Basically just had to configure an A record with the GH IPs [24] and a CNAME record for the www subdomain to point to my new site. The custom domain name had to be added in the package.json as:\r\n\r\n```\r\n  \"homepage\": \"https://androochen.com\",\r\n```\r\n\r\nAlong with some other GH page scripts. The deployment process is fairly simple. To add and read more MD posts we can just run the main.js in the public file to convert them to JSON with `npm run server`.\r\n\r\nThen deploying the website will simply be `npm run deploy`\r\n\r\n[0] https://www.npmjs.com/package/npx \r\n\r\n[1] https://appdividend.com/2022/03/12/react-axios/ \r\n\r\n[2] https://millionjs.org/ \r\n\r\n[3] https://swc.rs/ \r\n\r\n[4] https://vercel.com/\r\n\r\n[5] next.js\r\n\r\n[6] https://babeljs.io/repl/#?browsers=defaults%2C%20not%20ie%2011%2C%20not%20ie_mob%2011&build=&builtIns=false&corejs=3.21&spec=false&loose=false&code_lz=GYVwdgxgLglg9mABACwKYBt1wBQEpEDeAUIogE6pQhlIA8AJjAG4B8AEhlogO5xnr0AhLQD0jVgG4iAXyJA&debug=false&forceAllTransforms=false&shippedProposals=false&circleciRepo=&evaluate=false&fileSize=false&timeTravel=false&sourceType=module&lineWrap=true&presets=react&prettier=false&targets=&version=7.18.9&externalPlugins=&assumptions=%7B%7D \r\n\r\n[7] https://linear.app/ \r\n\r\n[8] https://www.gatsbyjs.com/docs/reference/release-notes/migrating-from-v4-to-v5/#minimal-nodejs-version-1800 \r\n\r\n[9] https://nodesource.com/blog/understanding-how-node-js-release-lines-work/ \r\n\r\n[10] https://github.com/pi-hole/FTL/issues/1420 \r\n\r\n[11] https://askubuntu.com/questions/1428423/upgrade-ubuntu-in-wsl2-from-20-04-to-22-04 \r\n\r\n[12] https://stackoverflow.com/questions/72513993/how-to-install-glibc-2-29-or-higher-in-ubuntu-18-04 \r\n\r\n[13] https://dev.to/salothom/package-json-vs-package-lock-json-do-you-need-both-1mjf \r\n\r\n[14] https://www.geeksforgeeks.org/what-is-the-difference-between-element-and-component/ \r\n\r\n[15] https://fonts.google.com/specimen/Raleway \r\n\r\n[16] https://stackoverflow.com/questions/25661182/embed-youtube-video-refused-to-display-in-a-frame-because-it-set-x-frame-opti \r\n\r\n[17] https://github.com/remarkjs/react-markdown#use \r\n\r\n[18] https://github.com/remarkjs/react-markdown#appendix-a-html-in-markdown \r\n\r\n[19] https://github.com/rehypejs/rehype-raw \r\n\r\n[20] https://blog.webdevsimplified.com/2022-07/react-router/#Dynamic_Routing:~:text=useRoutes%20Hook-,Dynamic%20Routing,-The%20simplest%20and \r\n\r\n[21] https://bobbyhadz.com/blog/react-export-redirect-was-not-found-in-react-router-dom \r\n\r\n[23] https://www.youtube.com/watch?v=M5ZtKvk3Sag \r\n\r\n[24] https://docs.github.com/en/pages/configuring-a-custom-domain-for-your-github-pages-site/managing-a-custom-domain-for-your-github-pages-site#configuring-an-apex-domain\r\n\r\nAppendix\r\nChatGPT response:\r\nIt is common to define routing in a separate file from the root component of your app, and then import the routing information into the root component. This helps to keep the code for your routes separate from the rest of your app, which can make it easier to manage and maintain.\r\n\r\nWith this approach, you would typically define your routes in a file such as routes.js, and then import them into your root component (e.g. App.js) to make them available to the rest of the app.\r\n\r\nFor example, you might have the following code in your routes.js file:\r\n\r\n```\r\nimport {\r\n  BrowserRouter as Router,\r\n  Route,\r\n  Link\r\n} from \"react-router-dom\";\r\n\r\nfunction AppRoutes() {\r\n  return (\r\n    <Router>\r\n      <div>\r\n        <nav>\r\n          <ul>\r\n            <li>\r\n              <Link to=\"/\">Home</Link>\r\n            </li>\r\n            <li>\r\n              <Link to=\"/about\">About</Link>\r\n            </li>\r\n            <li>\r\n              <Link to=\"/users\">Users</Link>\r\n            </li>\r\n          </ul>\r\n        </nav>\r\n\r\n        <Route path=\"/\" exact component={Home} />\r\n        <Route path=\"/about\" component={About} />\r\n        <Route path=\"/users\" component={Users} />\r\n      </div>\r\n    </Router>\r\n  );\r\n}\r\n\r\nexport default AppRoutes;\r\n```\r\n\r\n\r\nAnd then in your App.js file, you would import the AppRoutes component and render it as part of your root component:\r\n\r\n```\r\nimport React from 'react';\r\nimport AppRoutes from './routes';\r\n\r\nfunction App() {\r\n  return (\r\n    <div>\r\n      <AppRoutes />\r\n    </div>\r\n  );\r\n}\r\n\r\nexport default App;\r\n```\r\n\r\nFinally, in your index.js file, you would import the App component and render it to the DOM:\r\n\r\n```\r\nimport React from 'react';\r\nimport ReactDOM from 'react-dom';\r\nimport App from './App';\r\n\r\nReactDOM.render(<App />, document.getElementById('root'));\r\n```\r\n\r\nThis is just one way that you can structure your React app with routing. There are many other approaches that you can take as well. The important thing is to choose an approach that works well for your particular app and that makes it easy to manage and maintain your code.\r\n\r\n"},{"id":1672473600,"title":"this is the second post\r","author":"androo\r","date":"December 31, 2022\r","content":"\r\n> ooo look a quote, something google docs doesn't support with their MD \r\n> parser. wth do they even do there.\r\n\r\n**like seriously -- what?**\r\n"},{"id":1672387200,"title":"dis be my first post\r","author":"androo\r","date":"December 30, 2022\r","content":"\r\n## Content\r\none day this will be filled with useless garbage. right now it's empty but not for long. WHAT THE FUCK\r\n\r\ngonna test throwing a video in here too.\r\n\r\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/3UrVkIl4jAE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\r\n"}]